OpenFOAM-v1806/tutorials/multiphase/compressibleInterDyMFoam/laminar/sphereDrop/Allrun
#!/bin/sh
cd ${0%/*} || exit 1                        # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions    # Tutorial run functions

runApplication blockMesh
runApplication topoSet

# remove empty patches
runApplication createPatch -overwrite

# split mesh into 2 regions at the AMI coupled patch
runApplication mergeOrSplitBaffles -overwrite

restore0Dir

runApplication setFields

(cd constant/polyMesh && ln -s ../../include/meshModifiers .)

runApplication $(getApplication)

#------------------------------------------------------------------------------
